
# თეორია:
# 1)კომენტარების სახით ახსენით iteration
# -----------------------------------------------------------------------------------------
#iteration არის გამეორება რომელიც შეიძლება იყოს 2-ჯერ, 10-ჯერ ან სამუდამოდ
# 2)კომენტარების სახით ახსენით  loop
# -----------------------------------------------------------------------------------------
#loop არის იგივე რაც iteration, ანუ გამეორება
# 3)კომენატრების სახით ახსენით infinity loop
# -----------------------------------------------------------------------------------------
#infinity loop არის უსასრულოდ გამეორება რომელიც არ დამთავრდება
# 4)კომენტარების სახით ახსენით for loop
# -----------------------------------------------------------------------------------------

# 5)კომენტარების სახით ჩამოწერეთ განმეორების მაგალითები
# -----------------------------------------------------------------------------------------
#
#
# პრაქტიკა:
# 1)შეასწორეთ კოდში შეცდომები:
# for i in range(1, 100):
# print(i)
# -----------------------------------------------------------------------------------------
#
# 2)გამოიტანეთ რიცხვები 1 დან 100 მდე for loop ით
# -----------------------------------------------------------------------------------------
for i in range(1, 100):
    print(i)
# 3)მომხარებელს შემოატანინეთ რამე და შემდეგ დაპრინტეთ, ეს მოქმედება გაიმეორეთ 10 ჯერ for loop ით
# -----------------------------------------------------------------------------------------

# 4)გამოიტანეთ რიცხვები 1 დან 50 მდე 5-5 ის გადახტომით for loop ით
# -----------------------------------------------------------------------------------------
for i in range(1,50, 5):
    print(i)
# 5)გამოიტანეთ რიცხვები 4 დან 8 მდე 2-2 ის  გადახტომით
# -----------------------------------------------------------------------------------------
for i in range(4,8, 2):
    print(i)
# 5)sololearn for loop ამდე