# თეორია:
# 1)კომენტარების სახით ახსენით რა არის boolean
# -----------------------------------------------------------------------------------------
#boolean-არის true და false
# 2)კომენტარების სახით ჩამოწერეთ data type(მონაცემთა ტიპი) 
# -----------------------------------------------------------------------------------------
#integer,string,float
# 3)კომენატრების სახით ახსენით რა არის binary
# -----------------------------------------------------------------------------------------
#bynary არის ერთადერთი ენა რომელიც არის გასაგები კომპიუტერისთვის და შედგება 0 და 1-ის გან
# 4)კომენტარების სახით ჩამოწერეთ ყველა ნასწავლი data conversation ფუნქცია (მაგ: int())
# -----------------------------------------------------------------------------------------
#str(),int(),float()
# 5)კომენტარების სახით ახსენით, რაზეა დამოკიდებული პროგრამირების ენის სიჩქარე, რისგან შედგება binary, ჩამოწერეთ True & False ის რიცხვობითი მნიშვნოლობები და იპოვეთ მსგავსება, binary სა და boolean ს შორის, მოიყვანეთ boolean ის რამოდენიმე მაგალითი
#პროგრამირების ენის სიჩქარე არის დამოკიდებული იმაზე რამდენად არის ის ახლოს binary-ს თან
#true და false რიცხობითი მნიშვნელობები არის 0 და 1